
var g_mjsArr = [
    11, 12, 13, 14, 15, 16, 17, 18, 19,
    11, 12, 13, 14, 15, 16, 17, 18, 19,
    11, 12, 13, 14, 15, 16, 17, 18, 19,
    11, 12, 13, 14, 15, 16, 17, 18, 19,
    21, 22, 23, 24, 25, 26, 27, 28, 29,
    21, 22, 23, 24, 25, 26, 27, 28, 29,
    21, 22, 23, 24, 25, 26, 27, 28, 29,
    21, 22, 23, 24, 25, 26, 27, 28, 29,
    31, 32, 33, 34, 35, 36, 37, 38, 39,
    31, 32, 33, 34, 35, 36, 37, 38, 39,
    31, 32, 33, 34, 35, 36, 37, 38, 39,
    31, 32, 33, 34, 35, 36, 37, 38, 39,
    41, 42, 43, 44, 45, 46, 47,
    41, 42, 43, 44, 45, 46, 47,
    41, 42, 43, 44, 45, 46, 47,
    41, 42, 43, 44, 45, 46, 47
];

// print 'reqOtherAction +2'
// samArr = [111, 111, 111, 111, 214, 214, 214, 214, 315, 315, 315, 315, 118, 119, 119 ]
// begin = datetime.datetime.now()
// print testHu(112, samArr, 111)
// end = datetime.datetime.now()
// print end-begin

// samArr = [405,104,104,107,107,203,204,205,207,105,107,108,109]
// getTingArr(samArr,405)
//testPengGang( 302,samArr, 403 ):
// hasGang( samArr, 115 )
//samArr = [101, 101,101,101,101,101,101,101,101,101,101,101,101,101,101,101,101 ]
//print testGang(101, samArr, 102)


var majmap = {"11":"一万","12":"二万","13":"三万","14":"四万","15":"五万","16":"六万","17":"七万","18":"八万","19":"九万",
          "21":"一饼","22":"二饼","23":"三饼","24":"四饼","25":"五饼","26":"六饼","27":"七饼","28":"八饼","29":"九饼",
          "31":"一条","32":"二条","33":"三条","34":"四条","35":"五条","36":"六条","37":"七条","38":"八条","39":"九条",
          "41":"东风","42":"西风","43":"南风","44":"北风","45":"红中","46":"发财","47":"白板"};

    //////////////////////////////////////////////////////////////////////////
    //测试胡牌
    // samArr = [111, 111, 111, 111, 214, 214, 214, 214, 315, 315, 315, 315, 118, 119, 119 ]
    // print testHu(112, samArr, 111)
    //////////////////////////////////////////////////////////////////////////


    //////////////////////////////////////////////////////////////////////////
    //测试具体能听哪些牌
//var samArr = [45,22,23,23,24,25,32,32,33,33]; //运行时间:0:00:00.001100 <callTime:83>  [ 一饼 , 四饼 , 二条 , 三条 , 红中 , ]
    // samArr = [405,202,203,203,204,205,301,302,303,303]//运行时间:0:00:00.000721 <callTime:72>  [ 一饼 , 四饼 , 三条 , 红中 , ]
    // samArr = [405,202,203,203,204,205,301,302,302,303]//运行时间:0:00:00.000659 <callTime:72>  [ 一饼 , 四饼 , 二条 , 红中 , ]
    // samArr = [405,203,203,204,205,301,302,302,303,303]//运行时间:0:00:00.000887 <callTime:72>  [ 三饼 , 六饼 , 一条 , 四条 , 红中 , ]
    // samArr = [405,202,203,204,205,301,302,302,303,303]//运行时间:0:00:00.000715 <callTime:59>  [ 二饼 , 五饼 , 一条 , 四条 , 红中 , ]
    // samArr = [405,202,203,203,204,301,302,302,303,303]//运行时间:0:00:00.000797 <callTime:72>  [ 三饼 , 一条 , 四条 , 红中 , ]
    // samArr = [405,104,104,107,107,107,203,204,205,305,307,308,309]//运行时间:0:00:00.000791 <callTime:83>  [ 四万 , 五条 , 三条 , 四条 , 六条 , 七条 , 红中 , ]
    // samArr = [405,104,104,107,107,107,203,204,205,207,307,308,309]//运行时间:0:00:00.000844 <callTime:85>  [ 四万 , 七饼 , 二饼 , 五饼 , 六饼 , 八饼 , 九饼 , 红中 , ]
    // samArr = [405,104,105,106,107,108,109,202,202,302,304,306,306]//运行时间:0:00:00.000799 <callTime:88>  [ 二饼 , 三条 , 六条 , 红中 , ]
    // samArr = [405,103,104,105,107,108,109,202,202,302,304,306,306]//运行时间:0:00:00.000859 <callTime:89>  [ 二饼 , 三条 , 六条 , 红中 , ]
    // samArr = [405,103,104,105,106,107,108,202,202,302,304,306,306]//运行时间:0:00:00.000836 <callTime:88>  [ 二饼 , 三条 , 六条 , 红中 , ]
    // //测试两个癞子的运行时间
    // samArr = [405,405,103,105,106,107,108,202,202,302,304,306,306]//运行时间:0:00:00.000955 <callTime:136>  [ 四万 , 二饼 , 三条 , 六条 , 红中 , ]
    // samArr = [405,405,103,105,106,107,108,201,202,302,304,306,306]//运行时间:0:00:00.000696 <callTime:94>  [ 四万 , 三饼 , 三条 , 红中 , ]
    // samArr = [405,405,103,105,106,107,108,201,202,302,303,306,306]//运行时间:0:00:00.000790 <callTime:94>  [ 四万 , 三饼 , 一条 , 四条 , 红中 , ]
    // //测试三个癞子的运行时间
var samArr = [45,45,45,15,16,17,18,22,22,32,34,36,36];//运行时间:0:00:00.001111 <callTime:135>  [ 五万 , 八万 , 三万 , 四万 , 六万 , 七万 , 九万 , 二饼 , 三条 , 六条 , 红中 , ]
    // samArr = [405,405,405,105,106,107,108,201,202,302,304,306,306]//运行时间:0:00:00.000926 <callTime:118>  [ 五万 , 八万 , 三万 , 四万 , 六万 , 七万 , 九万 , 三饼 , 三条 , 六条 , 红中 , ]
    // samArr = [405,405,405,105,106,107,108,201,202,302,303,306,306]//运行时间:0:00:00.000949 <callTime:116>  [ 五万 , 八万 , 三万 , 四万 , 六万 , 七万 , 九万 , 三饼 , 一条 , 四条 , 六条 , 红中 , ]
    // //测试四个癞子的运行时间
    // samArr = [405,405,405,405,106,107,108,202,202,302,304,306,306]//运行时间:0:00:00.000607 <callTime:18>  [ 一万 , 二万 , 三万 , 四万 , 五万 , 六万 , 七万 , 八万 , 九万 , 一饼 , 二饼 , 三饼 , 四饼 , 五饼 , 六饼 , 七饼 , 八饼 , 九饼 , 一条 , 二条 , 三条 , 四条 , 五条 , 六条 , 七条 , 八条 , 九条 , 东风 , 西风 , 南风 , 北风 , 红中 , 发财 , 白板 , ]
    // samArr = [405,405,405,405,106,107,108,201,202,302,304,306,306]//运行时间:0:00:00.000390 <callTime:18>  [ 一万 , 二万 , 三万 , 四万 , 五万 , 六万 , 七万 , 八万 , 九万 , 一饼 , 二饼 , 三饼 , 四饼 , 五饼 , 六饼 , 七饼 , 八饼 , 九饼 , 一条 , 二条 , 三条 , 四条 , 五条 , 六条 , 七条 , 八条 , 九条 , 东风 , 西风 , 南风 , 北风 , 红中 , 发财 , 白板 , ]
    // samArr = [405,405,405,405,106,107,108,201,202,302,303,306,306]//运行时间:0:00:00.000758 <callTime:18>  [ 一万 , 二万 , 三万 , 四万 , 五万 , 六万 , 七万 , 八万 , 九万 , 一饼 , 二饼 , 三饼 , 四饼 , 五饼 , 六饼 , 七饼 , 八饼 , 九饼 , 一条 , 二条 , 三条 , 四条 , 五条 , 六条 , 七条 , 八条 , 九条 , 东风 , 西风 , 南风 , 北风 , 红中 , 发财 , 白板 , ]
    //////////////////////////////////////////////////////////////////////////

    //////////////////////////////////////////////////////////////////////////
    //测试打出哪些牌能听
    // tingNumArr = [405,202,203,203,204,205,301,302,302,303,303]//运行时间:0:00:00.000704 <callTime:48>  [ 二饼 , 三饼 , 五饼 , 一条 , 二条 , 三条 , ]
    // tingNumArr = [405,104,104,107,107,107,203,204,205,207,305,307,308,309]//运行时间:0:00:00.000649 <callTime:61>  [ 七饼 , 五条 , ]
    // tingNumArr = [405,103,104,105,106,107,108,109,202,202,302,304,306,306]//运行时间:0:00:00.000874 <callTime:82>  [ 三万 , 六万 , 九万 , ]
    // //测试两个癞子
    // tingNumArr = [405,405,203,203,204,205,301,302,302,303,303]//运行时间:0:00:00.000424 <callTime:35>  [ 三饼 , 四饼 , 五饼 , 一条 , 二条 , 三条 , ]
    // tingNumArr = [405,405,104,107,107,107,203,204,205,207,305,307,308,309]//运行时间:0:00:00.000616 <callTime:63>  [ 四万 , 七饼 , 五条 , ]
    // tingNumArr = [405,405,104,105,106,107,108,109,202,202,302,304,306,306]//运行时间:0:00:00.000551 <callTime:48>  [ 四万 , 五万 , 六万 , 七万 , 八万 , 九万 , 二饼 , 四条 , 六条 , 二条 , ]
    // //测试三个癞子
    // tingNumArr = [405,405,405,203,204,205,301,302,302,303,303]//运行时间:0:00:00.000493 <callTime:27>  [ 三饼 , 四饼 , 五饼 , 一条 , 二条 , 三条 , ]
    // tingNumArr = [405,405,405,107,107,107,203,204,205,207,305,307,308,309]//运行时间:0:00:00.000518 <callTime:36>  [ 七万 , 三饼 , 四饼 , 五饼 , 七饼 , 五条 , 七条 , 八条 , 九条 , ]
var tingNumArr = [45,45,45,15,16,17,18,19,22,22,32,34,36,36];//运行时间:0:00:00.000522 <callTime:53>  [ 五万 , 六万 , 七万 , 八万 , 九万 , 二饼 , 四条 , 六条 , 二条 , ]
    // //测试四个癞子
    // tingNumArr = [405,405,405,405,204,205,301,302,302,303,303]//运行时间:0:00:00.000422 <callTime:24>  [ 四饼 , 五饼 , 一条 , 二条 , 三条 , ]
    // tingNumArr = [405,405,405,405,107,107,203,204,205,207,305,307,308,309]//运行时间:0:00:00.000604 <callTime:35>  [ 七万 , 三饼 , 四饼 , 五饼 , 七饼 , 五条 , 七条 , 八条 , 九条 , ]

//var tingNumArr = [405,405,405,405,106,107,108,109,202,202,302,304,306,306]; //运行时间:0:00:00.000678 <callTime:31>  [ 六万 , 七万 , 八万 , 九万 , 二饼 , 四条 , 六条 , 二条 , ]
    //tingNumArr = [407,407,104,105,106,106,306,306,402,402,405,405,406,406]

    ////////////////////////////////////////////////////////////
    // 测试特殊情况  单一花色重复多次
    // tingNumArr = [405,201,201,201,201,202,202,202,202,205,205,205,205,209]//运行时间:0:00:00.006123 <callTime:356>  [ 五饼 , 九饼 , ]
    // tingNumArr = [405,405,202,204,205,205,206,206,207,208,208,208,209,306]//运行时间:0:00:00.002929 <callTime:358>  [ 二饼 , 九饼 , 六条 , ]
    // samArr = [405,201,201,201,201,201,202,202,202,202,204,204,205]//运行时间:0:00:00.016391 <callTime:1029>  [ 三饼 , 六饼 , 红中 , ]
    // samArr = [405,405,201,201,201,201,202,202,202,202,204,204,209]//运行时间:0:00:00.026671 <callTime:1527>  [ 三饼 , 四饼 , 七饼 , 八饼 , 九饼 , 红中 , ]
    ////////////////////////////////////////////////////////////

    var wc = require('./wildcard');

    wc.callTime = 0;
    //begin = datetime.datetime.now()
    var begin = Date.now();
    // 测试摸哪些牌能胡牌
    var tingArr = wc.getTings(samArr, 45);
    //测试打哪些牌能听牌
    //var tingArr = wc.getTingOuts(tingNumArr,45);
    //测试摸到这张牌是不是能胡牌
    // tingArr = {}
    // print wc.testHu(209, samArr, 405)
    // tingArr = []
    // for i in tingNumArr:
    //     tmp = []
    //     tmp.extend(tingNumArr)
    //     tmp.remove(i)
    //     getTingNumArr(tmp,405)
    //end = datetime.datetime.now()
    //runTime = end-begin

    end = Date.now();
    runTime = end - begin;

    console.log('运行时间：' + runTime + ' callTime: ' + wc.callTime);

    //rstr = )"运行时间:" + str(runTime) + " <callTime:" + str(callTime) + ">  [ "
    var ret = '';
    for (var i = 0; i < tingArr.length; i++) {
        var key = '' + tingArr[i];
        //rstr +=  majmap.get(key) + " , "
	if (majmap[key] == null) {
		console.log('key not found: ' + key);
		continue;
	}

	ret += majmap[key] + ', ';
    }
    //rstr += "]"
    console.log(ret);

